In [ ]:
%pip install datasets

In [2]:
from datasets import load_dataset

dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

/home/mohammadne/.local/lib/python3.13/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [5]:
df.head(3)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,NaN,NaN,Boehringer Ingelheim,None,None
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,NaN,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."

In [ ]:
df.info()

df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 785741 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        785741 non-null  object
 1   job_title              785740 non-null  object
 2   job_location           784696 non-null  object
 3   job_via                785733 non-null  object
 4   job_schedule_type      773074 non-null  object
 5   job_work_from_home     785741 non-null  bool
 6   search_location        785741 non-null  object
 7   job_posted_date        785741 non-null  object
 8   job_no_degree_mention  785741 non-null  bool
 9   job_health_insurance   785741 non-null  bool
 10  job_country            785692 non-null  object
 11  salary_rate            33067 non-null   object
 12  salary_year_avg        22003 non-null   float64
 13  salary_hour_avg        10662 non-null   float64
 14  company_name           785723 non-null  object
 15  job_skills             668704 non-null  object
 16  job_type_skills        668704 non-null  object
dtypes: bool(3), float64(2), object(12)
memory usage: 86.2+ MB

       salary_year_avg  salary_hour_avg
count     22003.000000     10662.000000
mean     123286.274072        47.016598
std       48312.449482        21.890738
min       15000.000000         8.000000
25%       90000.000000        27.500000
50%      115000.000000        45.980000
75%      150000.000000        61.159996
max      960000.000000       391.000000

In [8]:
df[(df['job_title_short'] == 'Business Analyst') & (df['salary_year_avg'].notna())]

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
520,Business Analyst,Power BI Analyst,"San Pedro Sula, Honduras",via Ai-Jobs.net,Full-time,False,Honduras,2023-07-24 14:05:29,True,False,Honduras,year,63000.0,NaN,Charger Logistics Inc,['power bi'],{'analyst_tools': ['power bi']}
645,Business Analyst,Lead BI Analyst,"Irvine, CA",via LinkedIn,Full-time,False,"California, United States",2023-08-11 13:01:18,False,False,United States,year,125000.0,NaN,KORE1,"['sql', 'python', 'tableau']","{'analyst_tools': ['tableau'], 'programming': ..."
2125,Business Analyst,Business Analyst to support Channel Engagement...,Sweden,via Ai-Jobs.net,Full-time,False,Sweden,2023-12-29 13:16:44,False,False,Sweden,year,43200.0,NaN,Nordea,['qlik'],{'analyst_tools': ['qlik']}
2653,Business Analyst,BI Analyst,South Africa,via Ai-Jobs.net,Full-time,False,South Africa,2023-12-10 13:13:47,False,False,South Africa,year,130000.0,NaN,Nedbank,['sql'],{'programming': ['sql']}
2922,Business Analyst,BI Analyst,"Orlando, FL",via LinkedIn,Full-time,False,"Florida, United States",2023-07-05 13:03:02,False,True,United States,year,85000.0,NaN,Hays,"['sql', 'tableau']","{'analyst_tools': ['tableau'], 'programming': ..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
773734,Business Analyst,People Operations Analyst,"Fort Worth, TX",via ZipRecruiter,Full-time,False,"Texas, United States",2023-10-17 01:01:18,False,True,United States,year,60000.0,NaN,Alpine IQ,None,None
774339,Business Analyst,Regional Insight Analyst (CRM & Loyalty) for E...,"Warsaw, Poland",via Ai-Jobs.net,Full-time,False,Poland,2023-03-16 01:24:09,False,False,Poland,year,80850.0,NaN,H&M Group,"['sql', 'sas', 'sas', 'tableau']","{'analyst_tools': ['sas', 'tableau'], 'program..."
774510,Business Analyst,Business Intelligence Analyst,"Miami, FL",via LinkedIn,Full-time,False,"Florida, United States",2023-01-11 01:19:05,False,False,United States,year,77500.0,NaN,Robert Half,"['sql', 'go', 'excel', 'tableau']","{'analyst_tools': ['excel', 'tableau'], 'progr..."
777877,Business Analyst,Senior Business Intelligence Engineer,"Lagos, Nigeria",via Ai-Jobs.net,Full-time,False,Nigeria,2023-06-01 05:31:32,False,False,Nigeria,year,99150.0,NaN,Lemonade Finance,"['sql', 'bigquery', 'redshift', 'tableau']","{'analyst_tools': ['tableau'], 'cloud': ['bigq..."
778911,Business Analyst,"Lead BI Analyst (Supply Analytics, Bangkok-based)","Bangkok, Thailand",via Ai-Jobs.net,Full-time,False,Thailand,2023-06-10 05:19:29,False,False,Thailand,year,63000.0,NaN,Agoda,"['sql', 'tableau']","{'analyst_tools': ['tableau'], 'programming': ..."